I-SYST/EHAL/ARM/Nordic/nRF51/exemples/Blinky_ble/src/BlinkyBleMain.c
static void blinkys_write_handler(ble_blinkys_t * p_blinkys, uint8_t *data, int len)
{
	BLINKY_CMD *p = (BLINKY_CMD *)data;
	int l = len / sizeof(BLINKY_CMD);

	for (int i = 0; i < l; i++)
	{
		switch (p->cmd)
		{
			case BLINKY_CMD_OFF:
				nrf_gpio_pin_clear(p->iopin);
				break;
			case BLINKY_CMD_ON:
				nrf_gpio_pin_set(p->iopin);
				break;
			case BLINKY_CMD_CFGOUTPUT:
				nrf_gpio_cfg_output(p->iopin);
				break;
			case BLINKY_CMD_CFGINPUT:
			    nrf_gpio_cfg_input(p->iopin, NRF_GPIO_PIN_PULLUP);
				break;
		}
    }
}

/**@brief Function for initializing the services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
	ble_blinkys_init_t blinkyscfg;

	blinkyscfg.write_handler = blinkys_write_handler;
	ble_blinkys_init(&g_BlinkyServ, &blinkyscfg);

    /** @snippet [DFU BLE Service initialization] */
    ble_dfu_init_t   dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    //dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    //dfus_init.error_handler  = NULL; //service_error_handler - Not used as only the switch from app to DFU mode is required and not full dfu service.

    //uint32_t err_code = ble_dfu_init(&m_dfus, &dfus_init);
   // APP_ERROR_CHECK(err_code);

   // dfu_app_reset_prepare_set(reset_prepare);
    /** @snippet [DFU BLE Service initialization] */
}

void BLEStart(void)
{
	// Initialize Bluetooth Stack parameters
	g_BlinkyServ.conn_handle = BLE_CONN_HANDLE_INVALID;

	ble_stack_init();
	services_init();
	device_manager_init();
	gap_params_init();
    //bas_init();
    dis_init();
	advertising_init();
	conn_params_init();
	sec_params_init();

	// Start advertising
	advertising_start();
}

static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
  //  err_code = app_timer_create(&m_battery_timer_id,
  //                              APP_TIMER_MODE_REPEATED,
  //                              battery_level_meas_timeout_handler);
   // APP_ERROR_CHECK(err_code);

    //err_code = app_timer_create(&m_heart_rate_timer_id,
    //                            APP_TIMER_MODE_REPEATED,
    //                            heart_rate_meas_timeout_handler);
    //APP_ERROR_CHECK(err_code);
}

void blink()
{
	while (1)
	{
		nrf_gpio_pin_set(30);
		for (int i=0; i < 10000; i++)
		__NOP();
		nrf_gpio_pin_clear(30);
		for (int i=0; i < 10000; i++)
		__NOP();
	}

}

int main()
{
//	NRF_POWER->DCDCEN = 1;
	uint32_t err_code;

	APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
	nrf_gpio_cfg_output(LED_CON);
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
	timers_init();

//	blink();
	nrf_gpio_pin_clear(LED_CON);
	err_code = app_gpiote_user_register(&g_GpioteId,
	                                  0xffffffff,
	                                  0xffffffff,
	                                  gpiote_event_handler);
	APP_ERROR_CHECK(err_code);

	BLEStart();
	app_gpiote_user_enable(g_GpioteId);
//	timers_start();
//	blink();


	while (1)
	{
		app_sched_execute();
		err_code = sd_app_evt_wait();
		APP_ERROR_CHECK(err_code);
		//BlueIOADCStart();
	}
}
